[
  {
    "id": "hand-gesture",
    "title": "Hand Gesture Recognition",
    "date": "Dec 2024 - Feb 2025",
    "year": "2025",
    "role": "Lead ML Engineer",
    "tags": ["cv", "vlm"],
    "description": "Built real-time hand gesture recognition with hybrid LSTM + XGBoost architecture. Led data collection and MVP development.",
    "metrics": ["30+ FPS Real-time", "95%+ Accuracy"],
    "technologies": ["LSTM", "XGBoost", "OpenCV", "Real-time"],
    "challenge": "Building real-time gesture recognition required robust hand keypoint detection, temporal pattern recognition, and low-latency inference for interactive applications across varying hand sizes and lighting conditions.",
    "solution": "Implemented hybrid approach combining LSTM for temporal sequence modeling with XGBoost for spatial feature classification. Led data collection with coordinated participants and created comprehensive data capture guidelines.",
    "technical": "Architecture: MediaPipe for 21-point hand keypoint detection, LSTM for temporal analysis, XGBoost for gesture classification. Real-time optimization: 30+ FPS on edge devices using TensorRT. Data pipeline: 100+ gesture videos with augmentation.",
    "results": "95%+ accuracy across 10+ gestures. Real-time performance: 30+ FPS. MVP successfully demonstrated with 99% reliability in interactive media player control."
  },
  {
    "id": "vlm-ocr",
    "title": "VLM-OCR Product",
    "date": "Jun 2024 - Present",
    "year": "2024",
    "role": "Lead ML Engineer",
    "tags": ["vlm", "ocr"],
    "description": "Led team to fine-tune Vision-Language Models with zero-error inference system for major education company.",
    "metrics": ["Zero-Error Production", "99.95% Confidence"],
    "technologies": ["VLM", "BERT", "PyTorch", "Fine-tuning"],
    "challenge": "Traditional OCR struggled with complex documents and domain-specific text. Needed zero-error inference for critical financial documents from major education company with hallucination mitigation.",
    "solution": "Fine-tuned Vision-Language Models on customer-specific datasets combining synthetic and real data. Developed verification framework using traditional OCR methods to detect and mitigate hallucinations.",
    "technical": "Fine-tuned BERT encoder with visual ResNet backbone. Custom attention for cross-modal alignment. Synthetic data generation for domain adaptation. Verification pipeline using multiple OCR methods. AWS deployment with monitoring.",
    "results": "Zero-error inference deployed in production. 99.95% confidence on all predictions. Domain adaptation improved accuracy by 30%. Production-grade system for major education company."
  },
  {
    "id": "license-plate",
    "title": "Japanese License Plate Recognition",
    "date": "Oct 2023 - Nov 2024",
    "year": "2023-2024",
    "role": "Manager",
    "tags": ["automotive", "ocr", "cv"],
    "description": "Led design and deployment achieving 99.8% accuracy for major parking operator nationwide deployment.",
    "metrics": ["99.8% Accuracy", "50+ Deployments", "500+ plates/min"],
    "technologies": ["CNN", "Attention", "LSTM", "TensorRT"],
    "challenge": "License plate recognition required handling varying formats, weather conditions, occlusion, and lighting. Needed 99%+ accuracy for police department deployment across Japan with tier-1 operator.",
    "solution": "Designed multi-stage deep learning pipeline: YOLOv8 for plate detection, ResNet with attention for character recognition, LSTM for sequence correction. Led team through design and deployment.",
    "technical": "Stage 1: YOLOv8 for plate localization. Stage 2: ResNet-34 + Attention for character recognition. Stage 3: LSTM for sequence correction. Training data: 100K real + 200K synthetic plates. TensorRT optimization: 500+ plates/minute.",
    "results": "99.8% character-level accuracy achieved. Deployed to 50+ police stations nationwide. 500+ plates/minute processing capacity. False positive rate < 0.1%."
  },
  {
    "id": "parking",
    "title": "Automatic Parking System",
    "date": "Oct 2023 - Present",
    "year": "2023-2024",
    "role": "Manager",
    "tags": ["automotive", "cv"],
    "description": "Directed keypoint prediction models for autonomous parking with engagement from major automotive OEMs.",
    "metrics": ["100% Demo Success", "60 FPS Real-time", "98.5% Accuracy"],
    "technologies": ["Keypoint Detection", "Synthetic Data", "TensorRT", "Real-time"],
    "challenge": "Autonomous parking required precise keypoint and line prediction in real-world conditions with varying camera angles, lighting, and parking configurations. 100% reliability needed for commercial deployment.",
    "solution": "Developed keypoint detection model trained on 100K synthetic scenarios. Implemented uncertainty estimation for safety. Supervised data pipeline with synthetic generation, labeling tools, and sampling strategies.",
    "technical": "HRNet backbone for multi-scale extraction. 16 keypoint predictions per frame. Synthetic data augmentation and domain randomization. TensorRT optimization for real-time inference. Integration with path planning.",
    "results": "100% success rate in 20+ real-world demos. 98.5% detection accuracy. 60 FPS on edge hardware. Engagement from major Japanese automotive OEMs. Commercial-ready system."
  },
  {
    "id": "ocr-platform",
    "title": "OCR Product Platform",
    "date": "Jan 2022 - Present",
    "year": "2022-2024",
    "role": "Lead ML Engineer",
    "tags": ["ocr"],
    "description": "Managed end-to-end OCR product with multiple customer deployments. Built MLOps pipelines and production systems.",
    "metrics": ["Multiple Customers", "Production AWS Deployment"],
    "technologies": ["CNN", "LSTM", "Transformer", "MLflow", "DVC", "PyQt5"],
    "challenge": "Building end-to-end OCR platform for multiple customers with diverse document types. Required MLOps infrastructure and rapid model iteration.",
    "solution": "Developed modular OCR architecture supporting multiple document types. Implemented MLOps pipeline with MLflow and DVC for experiment tracking. Created PyQt5 GUI for data labeling and model evaluation.",
    "technical": "Multi-task architecture: text detection, recognition, and verification. MLflow for experiment tracking and model registry. DVC for data versioning. PyQt5 annotation tool. Docker containerization for deployment. AWS SageMaker integration.",
    "results": "Successfully deployed to 5+ enterprise customers. Reduced model iteration time by 40%. Automated data pipeline processes. Achieved 95%+ accuracy across diverse document types."
  },
  {
    "id": "adas",
    "title": "ADAS (Advanced Driver Assistance)",
    "date": "Feb 2019 - Present",
    "year": "2019-Present",
    "role": "Lead ML Engineer",
    "tags": ["adas", "cv", "automotive"],
    "description": "Led 8-engineer team delivering perception systems to tier-1 automotive suppliers with 50% experiment cycle improvement.",
    "metrics": ["8 Engineers Led", "50% Faster Cycles", "Tier-1 Deployment"],
    "technologies": ["Object Detection", "MLflow", "W&B", "TensorRT", "Quantization"],
    "challenge": "Developing perception systems for ADAS required handling diverse weather conditions, real-time constraints, and integration with automotive-grade hardware. Team scaling and experiment management were critical challenges.",
    "solution": "Built scalable MLOps infrastructure with MLflow and Weights & Biases. Established standardized experiment protocols. Implemented automated model optimization pipeline for TensorRT deployment.",
    "technical": "Object detection framework: YOLOv8 backbone with custom heads. Real-time optimization: post-training quantization and pruning. MLflow for centralized experiment tracking. Weights & Biases for team collaboration. TensorRT optimization for tier-1 hardware.",
    "results": "50% reduction in experiment cycle time. Successfully deployed to tier-1 automotive suppliers. Team grown from 3 to 8 engineers. Models achieving 95%+ mAP on diverse datasets. 40 FPS inference on automotive hardware."
  },
  {
    "id": "lidar-sdk",
    "title": "Lidar SDK Development",
    "date": "Mar 2017 - Oct 2018",
    "year": "2015-2018",
    "role": "Software Engineer",
    "tags": ["legacy"],
    "description": "Developed GUI software for Lidar systems using C# and Winforms Framework at Alink Corp, Yokohama.",
    "metrics": [],
    "technologies": ["C#", "Winforms", "GUI"],
    "challenge": "Creating user-friendly GUI for Lidar data visualization and system control required learning Winforms framework and implementing real-time data rendering.",
    "solution": "Built comprehensive desktop application using C# and Winforms with real-time Lidar data visualization and system controls.",
    "technical": "C# implementation with Winforms framework. Real-time data visualization. System configuration interface. Data logging and export functionality.",
    "results": "Successfully deployed GUI application for Lidar systems at Alink Corp."
  },
  {
    "id": "satellite",
    "title": "Small Satellite System Architecture",
    "date": "Oct 2015 - Mar 2017",
    "year": "2015-2018",
    "role": "System Engineer",
    "tags": ["legacy"],
    "description": "Designed system architecture and interfaces for small satellite at Vietnam National Space Center.",
    "metrics": [],
    "technologies": ["Systems Engineering", "Architecture"],
    "challenge": "Designing comprehensive system architecture for small satellite required understanding of space systems, constraints, and integration challenges.",
    "solution": "Developed detailed system architecture and interface specifications for small satellite systems.",
    "technical": "System architecture design. Interface specifications. Requirements engineering. System integration planning.",
    "results": "Completed system architecture design for small satellite project at Vietnam National Space Center."
  },
  {
    "id": "3g-bts",
    "title": "3G Base Transceiver Station",
    "date": "Sep 2010 - Oct 2012",
    "year": "2015-2018",
    "role": "Software Engineer",
    "tags": ["legacy"],
    "description": "Developed 3G BTS software using C++ at NTT DATA Vietnam for telecommunications infrastructure.",
    "metrics": [],
    "technologies": ["C++", "Telecom", "3G Networks"],
    "challenge": "Developing 3G Base Transceiver Station software required expertise in telecommunications protocols and embedded systems.",
    "solution": "Implemented 3G BTS software components using C++ for telecommunications infrastructure.",
    "technical": "C++ development for telecom infrastructure. 3G protocol implementation. Embedded systems programming.",
    "results": "Successfully developed 3G BTS software components at NTT DATA Vietnam."
  }
]