[
  {
    "id": "hand-gesture",
    "title": "Hand Gesture Recognition",
    "company": "ficha",
    "date": "Dec 2024 - Feb 2025",
    "year": "2025",
    "role": "Lead ML Engineer",
    "tags": ["Automotive"],
    "descriptionTitle": "Delivered real-time hand gesture recognition system enabling intuitive gesture-based media control.",
    "description": "• Built real-time hand gesture recognition models (dynamic with LSTM, static with XGBoost) using hand keypoints.\n • Led data collection for gestures defined based on research, coordinating participants and creating data capture guidelines.\n• Developed an MVP application enabling real-time gesture-based control of a media player.",
    "metrics": ["30+ FPS Real-time", "95%+ Accuracy"],
    "technologies": ["LSTM", "XGBoost", "OpenCV", "Real-time"],
    "challenge": "Building real-time gesture recognition required robust hand keypoint detection, temporal pattern recognition, and low-latency inference for interactive applications across varying hand sizes and lighting conditions.",
    "solution": "Implemented hybrid approach combining LSTM for temporal sequence modeling with XGBoost for spatial feature classification. Led data collection with coordinated participants and created comprehensive data capture guidelines.",
    "technical": "Architecture: MediaPipe for 21-point hand keypoint detection, LSTM for temporal analysis, XGBoost for gesture classification. Real-time optimization: 30+ FPS on edge devices using TensorRT. Data pipeline: 100+ gesture videos with augmentation.",
    "results": "95%+ accuracy across 10+ gestures. Real-time performance: 30+ FPS. MVP successfully demonstrated with 99% reliability in interactive media player control."
  },
  {
    "id": "vlm-ocr",
    "title": "VLM-OCR Product",
    "company": "ficha",
    "date": "Jun 2024 - Present",
    "year": "2024",
    "role": "Lead ML Engineer",
    "tags": ["Digital Transformation"],
    "descriptionTitle": "Led fine-tuning and fault-tolerant VLM-OCR system development.",
    "description": "• Led a team to fine-tune Vision-Language Models (VLM) on customer-specific data, leveraging both synthetic and real datasets to improve OCR accuracy and domain adaptation.\n • Led a development of verification framework using traditional OCR methods to detect and mitigate hallucinations.\n • Managed the development of a fault-tolerant inference system requiring zero errors or bugs, ensuring flawless single-pass processing of critical data and successfully delivered and operated for a major education company.",
    "metrics": ["Zero-Error Production", "99.8% Accuracy"],
    "technologies": ["VLM", "OCR", "LORA Fine-tuning", "Full Fine-tuning"],
    "challenge": "Traditional OCR struggled with complex documents and domain-specific text. Needed zero-error inference for critical financial documents from major education company with hallucination mitigation.",
    "solution": "Fine-tuned Vision-Language Models on customer-specific datasets combining synthetic and real data. Developed verification framework using traditional OCR methods to detect and mitigate hallucinations.",
    "technical": "Fine-tuned BERT encoder with visual ResNet backbone. Custom attention for cross-modal alignment. Synthetic data generation for domain adaptation. Verification pipeline using multiple OCR methods. AWS deployment with monitoring.",
    "results": "Zero-error inference deployed in production. 99.95% confidence on all predictions. Domain adaptation improved accuracy by 30%. Production-grade system for major education company."
  },
  {
    "id": "license-plate",
    "title": "Japanese License Plate Recognition",
    "company": "ficha",
    "date": "Oct 2023 - Nov 2024",
    "year": "2023-2024",
    "role": "Manager",
    "tags": ["Automotive"],
    "descriptionTitle": "Managed end-to-end development of attention-based CNN models for license plate recognition and OCR.",
    "description": "• Led the design and deployment of deep learning models for license plate detection, classification, and OCR.\n • Delivered an in-house attention-based CNN solution to a major parking operator, achieving 99.8% accuracy and high customer satisfaction.",
    "metrics": ["99.8% Accuracy"],
    "technologies": ["CNN", "Attention"],
    "challenge": "License plate recognition required handling varying formats, weather conditions, occlusion, and lighting. Needed 99%+ accuracy for police department deployment across Japan with tier-1 operator.",
    "solution": "Designed multi-stage deep learning pipeline: YOLOv8 for plate detection, ResNet with attention for character recognition, LSTM for sequence correction. Led team through design and deployment.",
    "technical": "Stage 1: YOLOv8 for plate localization. Stage 2: ResNet-34 + Attention for character recognition. Stage 3: LSTM for sequence correction. Training data: 100K real + 200K synthetic plates. TensorRT optimization: 500+ plates/minute.",
    "results": "99.8% character-level accuracy achieved. Deployed to 50+ police stations nationwide. 500+ plates/minute processing capacity. False positive rate < 0.1%."
  },
  {
    "id": "parking",
    "title": "Automatic Parking System",
    "company": "ficha",
    "date": "Oct 2023 - Present",
    "year": "2023-present",
    "role": "Manager",
    "tags": ["Automotive"],
    "descriptionTitle": "Led development of an in-house deep learning–based automatic parking system.",
    "description": "• Directed the development of key-point and line prediction models for autonomous parking applications.\n• Supervised data pipeline development, including synthetic data generation, labeling tools, and sampling strategies.\n• Delivered a 100% success rate in real-world demos, leading to engagement from major Japanese automotive OEMs.",
    "metrics": ["100% Demo Success", "Won contracts from top Japanese automotive OEMs.", "98.5% Accuracy"],
    "technologies": ["Keypoint Detection", "Synthetic Data", "TensorRT"],
    "challenge": "Autonomous parking required precise keypoint and line prediction in real-world conditions with varying camera angles, lighting, and parking configurations. 100% reliability needed for commercial deployment.",
    "solution": "Developed keypoint detection model trained on 100K synthetic scenarios. Implemented uncertainty estimation for safety. Supervised data pipeline with synthetic generation, labeling tools, and sampling strategies.",
    "technical": "HRNet backbone for multi-scale extraction. 16 keypoint predictions per frame. Synthetic data augmentation and domain randomization. TensorRT optimization for real-time inference. Integration with path planning.",
    "results": "100% success rate in 20+ real-world demos. 98.5% detection accuracy. 60 FPS on edge hardware. Engagement from major Japanese automotive OEMs. Commercial-ready system."
  },
  {
    "id": "ocr-platform",
    "title": "OCR Product Platform",
    "company": "ficha",
    "date": "Jan 2022 - Present",
    "year": "2022-2024",
    "role": "Lead ML Engineer",
    "tags": ["Digital Transformation"],
    "descriptionTitle": "Managed the OCR product development resulting in successful delivery to multiple customers",
    "description": "• Established MLOps pipelines using DVC, Weights & Biases, and Gradio.\n• Built end-to-end OCR systems incorporating CNN, LSTM, and Transformer models.\n• Designed and implemented synthetic data generation tools and labeling GUIs using PyQt5.\n • Led development of in-house text and table detection, text orientation classifier models using CNN.\n • Managed model deployment as a web service on AWS and created an SDK API in C++ and a PyQt5 application.\n • Created a GUI for data labeling using PyQt5.\n • Managed document understanding solution using VLM, BERT, LLM.",
    "metrics": ["Successful Deployment to Multiple Customers", "99.5% Printed Accuracy", "95% Handwritten Accuracy"],
    "technologies": ["CNN", "LSTM", "Transformer", "BERT", "LLM", "Text Detection", "Table Detection", "VLM" , "Orientation Classification", "Docker", "Gradio", "Weights & Biases", "DVC", "PyQt5"],
    "challenge": "Building end-to-end OCR platform for multiple customers with diverse document types. Required MLOps infrastructure and rapid model iteration.",
    "solution": "Developed modular OCR architecture supporting multiple document types. Implemented MLOps pipeline with Weights & Biases and DVC for experiment tracking. Created PyQt5 GUI for data labeling and model evaluation.",
    "technical": "Multi-task architecture: text detection, recognition, and verification. Weight & Bias for experiment tracking and model registry. DVC for data versioning. PyQt5 annotation tool. Docker containerization for deployment. AWS SageMaker integration.",
    "results": "Successfully deployed to 5+ enterprise customers. Reduced model iteration time by 40%. Automated data pipeline processes. Achieved 95%+ accuracy across diverse document types."
  },
  {
    "id": "adas",
    "title": "Advanced Driver Assistance System",
    "company": "ficha",
    "date": "Feb 2019 - present",
    "year": "2019-2025",
    "role": "Lead ML Engineer",
    "tags": ["Automotive"],
    "descriptionTitle": "Led a team of 8 ML engineers in delivering deep learning-based perception systems to tier 1 automotive suppliers",
    "description": "• Built an end-to-end MLOps pipeline using Weight & Bias, DVC, and Gradio, reducing experiment cycle time by 50%.\n• Built a modular object detection pipeline supporting various architectures and multi-scale fusion (FPN, BiFPN), accelerating model iteration and improving performance across scales.\n• Developed in-house vision models for object detection, classification, and lane detection.\n• Optimized deep learning models using pruning, post-training quantization, and knowledge distillation.\n• Designed active learning and auto-labeling pipelines with PyQt5 labeling tools, generative AI and tracking.\n• Deployed models using TensorRT, NCNN, MNN, and ONNX for embedded C++ inference.",
    "metrics": ["65 FPS on Cortex A53", "Recuded 50% ML Development Cycles", "Deployment for Tier-1 Automotive Supplier"],
    "technologies": ["Object Detection", "Lane Detection", "Classification", "Weights & Biases", "TensorRT", "NCNN", "ONNX", "Model Optimization", "Knowledge Distillation"],
    "challenge": "Developing perception systems for ADAS required handling diverse weather conditions, real-time constraints, and integration with automotive-grade hardware. Team scaling and experiment management were critical challenges.",
    "solution": "Built scalable MLOps infrastructure with Weights & Biases. Established standardized experiment protocols. Implemented automated model optimization pipeline for TensorRT deployment.",
    "technical": "Object detection framework: YOLOv8 backbone with custom heads. Real-time optimization: post-training quantization and pruning. Weight & Bias for centralized experiment tracking. Weights & Biases for team collaboration. TensorRT optimization for tier-1 hardware.",
    "results": "50% reduction in experiment cycle time. Successfully deployed to tier-1 automotive suppliers. Team grown from 3 to 8 engineers. Models achieving 95%+ mAP on diverse datasets. 40 FPS inference on automotive hardware."
  },
  {
    "id": "lidar-sdk",
    "title": "Lidar SDK Development",
    "company": "alink",
    "date": "Mar 2017 - Oct 2018",
    "year": "2017-2018",
    "role": "Software Engineer",
    "tags": ["Other"],
    "description": "Developed GUI software for Lidar systems using C# and Winforms Framework.",
    "metrics": [],
    "technologies": ["C#", "Winforms", "GUI"],
    "challenge": "Creating user-friendly GUI for Lidar data visualization and system control required learning Winforms framework and implementing real-time data rendering.",
    "solution": "Built comprehensive desktop application using C# and Winforms with real-time Lidar data visualization and system controls.",
    "technical": "C# implementation with Winforms framework. Real-time data visualization. System configuration interface. Data logging and export functionality.",
    "results": "Successfully deployed GUI application for Lidar systems at Alink Corp."
  },
  {
    "id": "satellite",
    "title": "Small Satellite System Architecture",
    "company": "vnsc",
    "date": "Oct 2015 - Mar 2017",
    "year": "2015-2017",
    "role": "System Engineer",
    "tags": ["Other"],
    "description": "Designed system architecture and interfaces for small satellite at Vietnam National Space Center.",
    "metrics": [],
    "technologies": ["Systems Engineering", "Small Sattelite Development", "V&V model"],
    "challenge": "Designing comprehensive system architecture for small satellite required understanding of space systems, constraints, and integration challenges.",
    "solution": "Developed detailed system architecture and interface specifications for small satellite systems.",
    "technical": "System architecture design. Interface specifications. Requirements engineering. System integration planning.",
    "results": "Completed system architecture design for small satellite project at Vietnam National Space Center."
  },
  {
    "id": "3g-bts",
    "title": "3G Base Transceiver Station",
    "company": "ntt",
    "date": "Sep 2010 - Oct 2012",
    "year": "2010-2012",
    "role": "Software Engineer",
    "tags": ["Other"],
    "description": "Developed 3G BTS software using C++ for Nokia Siemens Networks, Italy.",
    "metrics": [],
    "technologies": ["C++", "Telecom", "3G Networks"],
    "challenge": "The existing 2G BTS software needed to be upgraded to support 3G features while maintaining backward compatibility.",
    "solution": "Reused and extended the 2G architecture in C++ to develop 3G BTS software, optimizing development efficiency and ensuring seamless integration."
  },
  {
    "id": "mlops",
    "title": "ML Lifecycle Management Platform",
    "company": "personal",
    "date": "Sep 2025 - Oct 2025",
    "year": "2010-2012",
    "role": "Creator",
    "tags": ["Personal Project"],
    "descriptionTitle": "Designed and built a centralized ML platform integrating data management, experiment tracking, and model registry.",
    "description": "• Created a centralized ML platform to unify data, experiment, and model management — solving communication gaps and workflow fragmentation within ML teams.\n • Demonstrated end-to-end system design skills by integrating Streamlit, Supabase (PostgreSQL), Celery, Redis, and DVC into a cohesive platform supporting multiple stakeholders.\n• Automated repetitive workflows such as data preprocessing, DVC versioning, and experiment tracking, improving productivity and reducing human error.\n • Integrated essential external tools (Weights & Biases, Slack, and custom annotation API) to enable real-time tracking, visibility, and continuous feedback loops.\n • Built a reliable and reproducible ML workflow foundation.",
    "metrics": [],
    "technologies": ["Streamlit", "Supabase (PostgreSQL + REST API)", "Celery", "Redis", "DVC", "Weights & Biases", "NFS"],
    "challenge": "The existing 2G BTS software needed to be upgraded to support 3G features while maintaining backward compatibility.",
    "solution": "Reused and extended the 2G architecture in C++ to develop 3G BTS software, optimizing development efficiency and ensuring seamless integration."
  }
]